; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city5)
	(fuel-level plane1 fl6)
	(at plane2 city8)
	(fuel-level plane2 fl4)
	(at plane3 city1)
	(fuel-level plane3 fl5)
	(at plane4 city6)
	(fuel-level plane4 fl4)
	(at plane5 city8)
	(fuel-level plane5 fl4)
	(at plane6 city1)
	(fuel-level plane6 fl5)
	(at person1 city4)
	(at person2 city8)
	(at person3 city2)
	(at person4 city0)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city1)
	(at plane3 city0)
	(at person1 city4)
	(at person2 city9)
	(at person3 city3)
	(at person4 city6)
	))

)

; plan
1. (fly plane6 city1 city0 fl5 fl4)
   deleted: (at plane6 city1) (fuel-level plane6 fl5)
   added: (at plane6 city0) (fuel-level plane6 fl4)
   goals met: 1 of 6
2. (board person4 plane6 city0)
   deleted: (at person4 city0)
   added: (in person4 plane6)
   goals met: 1 of 6
3. (zoom plane6 city0 city6 fl4 fl3 fl2)
   deleted: (at plane6 city0) (fuel-level plane6 fl4)
   added: (at plane6 city6) (fuel-level plane6 fl2)
   goals met: 1 of 6
4. (debark person4 plane6 city6)
   deleted: (in person4 plane6)
   added: (at person4 city6)
   goals met: 2 of 6
5. (board person2 plane5 city8)
   deleted: (at person2 city8)
   added: (in person2 plane5)
   goals met: 2 of 6
6. (zoom plane5 city8 city9 fl4 fl3 fl2)
   deleted: (at plane5 city8) (fuel-level plane5 fl4)
   added: (at plane5 city9) (fuel-level plane5 fl2)
   goals met: 2 of 6
7. (debark person2 plane5 city9)
   deleted: (in person2 plane5)
   added: (at person2 city9)
   goals met: 3 of 6
8. (zoom plane3 city1 city0 fl5 fl4 fl3)
   deleted: (at plane3 city1) (fuel-level plane3 fl5)
   added: (at plane3 city0) (fuel-level plane3 fl3)
   goals met: 4 of 6
9. (zoom plane1 city5 city1 fl6 fl5 fl4)
   deleted: (at plane1 city5) (fuel-level plane1 fl6)
   added: (at plane1 city1) (fuel-level plane1 fl4)
   goals met: 5 of 6
10. (zoom plane1 city1 city2 fl4 fl3 fl2)
   deleted: (at plane1 city1) (fuel-level plane1 fl4)
   added: (at plane1 city2) (fuel-level plane1 fl2)
   goals met: 4 of 6
11. (board person3 plane1 city2)
   deleted: (at person3 city2)
   added: (in person3 plane1)
   goals met: 4 of 6
12. (zoom plane1 city2 city3 fl2 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl2)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 4 of 6
13. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 4 of 6
14. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   goals met: 5 of 6
15. (fly plane1 city3 city1 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 6 of 6
